<?php

require __DIR__ . '/vendor/autoload.php';


// ===========================================================================
// 1. 设置
// ===========================================================================

// 要劫持的网站地址
$target = "http://www.seo.cn" . $_SERVER['REQUEST_URI'];
$targetRegex = str_replace('/', '\\/', $target);
$host = "/";

// ===========================================================================
// 2. 抓取
// ===========================================================================

//
$client = new GuzzleHttp\Client();
$res = $client->request('GET', $target);
// 把爬到的网页内容加到变量，然后再做处理
$html = '';
if ($res->getStatusCode() == 200) {
    $html = $res->getBody();
}

// ===========================================================================
// 3. 处理
// ===========================================================================

// 处理网页资源
$html = preg_replace('/src="(\/)(\S+)"/i', 'src="' . $target . '$2"', $html);
$html = preg_replace('/href="(\/)(\S+)"/i', 'href="' . $target . '$2"', $html);
$html = preg_replace('/<a\s+href="' . $targetRegex . '(\S+)?"/i', '<a href="' . $host . '$1"', $html);

// 加入些自定义内容
$html = preg_replace('(<body>)', '$1 <h1 style="font-size: 60px;">恭喜，这个网站已被成功镜像化！！！</h1>', $html);

// ===========================================================================
// 4. 输出
// ===========================================================================

//
echo $html;
